Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: `@Transactional(REQUIRES_NEW)`: starts a transaction if none was started ; if an existing one was started, suspends it and starts a new one for the boundary of that method.
zh_cn: `@Transactional(REQUIRES_NEW)` ：如果当前没有事务，则启动一个事务；如果已经启动了一个事务，则暂停该事务，并从该方法的边界开始重新启动一个新事务。

source: `@Transactional(SUPPORTS)`: if a transaction was started, joins it ; otherwise works with no transaction.
zh_cn: `@Transactional(SUPPORTS)` :如果一个事务已经开始，则加入它；否则在没有事务的情况下工作。

source: `@Transactional` can be used to control transaction boundaries on any CDI bean at the method level or at the class level to ensure every method is transactional. That includes REST endpoints.
zh_cn: `@Transactional` 可以用来在方法层或类层控制任何CDI bean的事务边界，以确保每个方法都是事务性的。这包括REST端点。

source: `CompletionStage` (from the JDK)
zh_cn: `CompletionStage` (来自JDK)

source: `ConsumerRecord` is provided by the underlying Kafka client and can be injected directly to the consumer method. Another simpler approach consists in using `Record`:
zh_cn: `ConsumerRecord` 由底层Kafka client提供，并且可以直接注入到consumer method中。另一种更简单的方法是使用 `Record`：

source: `CustomResource` would be activated on a `@QuarkusIntegrationTest` using `@QuarkusTestResource` as is described in the corresponding section of this doc.
zh_cn: `CustomResource` 将在 `@QuarkusIntegrationTest` 上通过使用 `@QuarkusTestResource` 激活，就如本文档对应部分所述。

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
zh_cn: `IdentityProvider` 将 `HttpAuthenticationMechanism` 提供的认证凭证转换为 `SecurityIdentity` 实例。

source: `IdentityProvider` verifies the authentication credentials and maps them to `SecurityIdentity`, which has the username, roles, original authentication credentials, and other attributes.
zh_cn: `IdentityProvider` 会验证认证凭证并将其映射到 `SecurityIdentity` ，其中包含用户名、角色、原始认证凭证和其他属性。

source: `Instant` or `UUID`
zh_cn: `Instant` 或 `UUID`

source: `JsonObject` can be used to map an object into its JSON representation and build an object from a JSON document:
zh_cn: `JsonObject` 可用于将一个对象映射到其JSON表示中，并从JSON文档中建立一个对象。

source: `KeycloakTestResourceLifecycleManager` registers `alice` and `admin` users. The user `alice` has the `user` role only by default - it can be customized with a `keycloak.token.user-roles` system property. The user `admin` has the `user` and `admin` roles by default - it can be customized with a `keycloak.token.admin-roles` system property.
zh_cn: `KeycloakTestResourceLifecycleManager` 注册 `alice` 和 `admin` 用户。默认情况下，用户 `alice` 仅具有 `user` 角色 - 可以使用 `keycloak.token.user-roles` 系统属性对其进行自定义。默认情况下，用户 `admin` 具有 `用户` 和 `admin` 角色 - 可以使用 `keycloak.token.admin-roles` 系统属性对其进行自定义。

source: `ObjectId` can be difficult to use if you want to expose its value in your REST service. So we created Jackson and JSON-B providers to serialize/deserialize them as a `String` which are automatically registered if your project depends on either the RESTEasy Reactive Jackson extension or the RESTEasy Reactive JSON-B extension.
zh_cn: 如果您想在 REST 服务中公开它的值，则 `ObjectId` 可能很难使用。因此，我们创建了 Jackson 和 JSON-B 提供程序，将它们序列化为 `String` ，如果您的项目依赖于 RESTEasy Reactive Jackson 扩展或 RESTEasy Reactive JSON-B 扩展，则会自动注册。

source: `OidcWiremockTestResource` does not work with `@QuarkusIntegrationTest` against Docker containers, because the Wiremock server is running in the JVM running the test, which cannot be accessed from the Docker container running the Quarkus application.
zh_cn: `OidcWiremockTestResource` 不适用于针对Docker容器的 `@QuarkusIntegrationTest` ，因为Wiremock服务器在运行测试的JVM中运行，无法被在Docker容器中运行的Quarkus应用程序访问。

source: `OutgoingKafkaRecordMetadata` allows to set metadata attributes of the Kafka record, such as `key`, `topic`, `partition` or `timestamp`. One use case is to dynamically select the destination topic of a message. In this case, instead of configuring the topic inside your application configuration file, you need to use the outgoing metadata to set the name of the topic.
zh_cn: `OutgoingKafkaRecordMetadata` 允许您设置Kafka记录的元数据属性，如 `key` ， `topic` ， `partition` 或 `timestamp` 。一种场景是动态地选择消息的目标topic。在这种情况下，您需要使用出站元数据(outgoing metadata)来设置topic名称，而不是在配置文件中配置topic。

source: `PanacheQuery` also allows range-based queries.
zh_cn: `PanacheQuery` 也允许基于范围的查询。

source: `Publisher` (from Reactive-Streams)
zh_cn: `Publisher` (来自Reactive-Streams)

source: `QuarkusTestResourceLifecycleManager` implementations can also implement `ContextAware` to get access to these properties, which allows you to set up the resource before Quarkus starts (e.g. configure a KeyCloak instance, add data to a database etc).
zh_cn: `QuarkusTestResourceLifecycleManager` 实现也可以实现 `ContextAware` 接口，以获得对这些属性的访问，这允许您在Quarkus启动之前来配置资源（例如，配置一个KeyCloak实例，向数据库添加数据等）。

source: `REQUIRED` or `NOT_SUPPORTED` are probably the most useful ones. This is how you decide whether a method is to be running within or outside a transaction. Make sure to check the JavaDoc for the precise semantic.
zh_cn: `REQUIRED` 或 `NOT_SUPPORTED` 可能是最有用的。它们决定一个方法是在事务内还是事务外运行。请确保查看JavaDoc以了解准确的语义。

source: `ReactiveGreetingResource.kt` looks like this:
zh_cn: `ReactiveGreetingResource.kt` 看起来像这样：

source: `Record` is a simple wrapper around key and payload of the incoming Kafka record.
zh_cn: `Record` 提供了对接收到的Kafka record中key和payload的简单的包装。

source: `accept` - this strategy marks the AMQP message as _accepted_. The processing continues ignoring the failure. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation].
zh_cn: `accept` - 这个策略将AMQP消息标记为 _accepted_ 。处理会继续进忽略失败的情况。请参考 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[接受交付状态的文档] 。

source: `amount > ?1 and firstname != ?2` will be mapped to `{'amount': {'$gt': ?1}, 'firstname': {'$ne': ?2}}`
zh_cn: `amount > ?1 and firstname != ?2` 将被映射到 `{'amount': {'$gt': ?1}, 'firstname': {'$ne': ?2}}`

source: `announcement` used for general announcement with some impact.
zh_cn: `announcement` 用于具有一定影响的一般公告。

source: `bootstrap-example.sh` - example bootstrap script for native deployments
zh_cn: `bootstrap-example.sh` - 用于原生部署的bootstrap脚本示例

source: `cacerts` must be added to `function.zip`
zh_cn: 必须将 `cacerts` 添加到 `function.zip` 中

source: `dead-letter-queue.key.serializer`: the serializer used to write the record key on the dead letter queue. By default, it deduces the serializer from the key deserializer.
zh_cn: `dead-letter-queue.key.serializer` 该序列化器用来对记录到dead letter queue中的record key进行序列化。默认情况下，该序列化器会从key的反序列化器反推出。

source: `dead-letter-queue.topic`: the topic to use to write the records not processed correctly, default is `dead-letter-topic-$channel`, with `$channel` being the name of the channel.
zh_cn: `dead-letter-queue.topic` : 该topic用来保存未被正确处理的记录，默认为 `dead-letter-topic-$channel` ， `$channel` 是channel的名称。

source: `dead-letter-queue.value.serializer`: the serializer used to write the record value on the dead letter queue. By default, it deduces the serializer from the value deserializer.
zh_cn: `dead-letter-queue.value.serializer` :该序列化器用来对记录到dead letter queue中的record value进行序列化。默认情况下，该序列化器会从value的反序列化器反推出。

source: `dead-letter-queue`: the offset of the record that has not been processed correctly is committed, but the record is written to a Kafka dead letter topic.
zh_cn: `dead-letter-queue` ：未被正确处理的记录的偏移量会被提交，但该记录会被写入Kafka的dead letter topic。

source: `development-tips` used for blogs with tips to develop using Quarkus or Quarkus itself.
zh_cn: `development-tips` 用于带有使用Quarkus或Quarkus本身开发提示的博客。

source: `double` and `java.lang.Double`
zh_cn: `double` 和 `java.lang.Double`

source: `emailhash` you can get by running `echo -n your@email.org | md5sum` on Linux or `echo -n your@email.org | md5` on macOS using an email you have registered from the [Gravatar service](https://gravatar.com),
zh_cn: 你可以使用您已经在 [Gravatar service](https://gravatar.com) 注册的电子邮件，在Linux运行 `echo -n your@email.org | md5sum` 或在macOS运行 `echo -n your@email.org | md5` 获得`emailhash` 。

source: `extension` used for blogs related to a specific extension.
zh_cn: `extension` 用于与特定扩展相关的博客。

source: `fail` - fail the application; no more AMQP messages will be processed (default). The AMQP message is marked as rejected.
zh_cn: `fail` - 使应用失败；不再处理AMQP消息（默认）。AMQP消息被标记为拒绝。

source: `fail`: fail the application, no more records will be processed (default strategy). The offset of the record that has not been processed correctly is not committed.
zh_cn: `fail` ：直接使程序失败，不再处理更多的记录(默认策略)。未被正确处理的记录的偏移量不会被提交。

source: `firstname = :firstname, status = :status` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
zh_cn: `firstname = :firstname, status = :status` 将被映射到更新文档中 `{'$set' : {'firstname': :firstname, 'status': :status}}`

source: `firstname = ?1 and status = ?2` will be mapped to `{'firstname': ?1, 'status': ?2}`
zh_cn: `firstname = ?1 and status = ?2` 将被映射到 `{'firstname': ?1, 'status': ?2}`

source: `firstname = ?1, status = ?2` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
zh_cn: `firstname = ?1, status = ?2` 将被映射到更新文档中 `{'$set' : {'firstname': ?1, 'status': ?2}}`

source: `float` and `java.lang.Float`
zh_cn: `float` 和 `java.lang.Float`

source: `from EntityName ...` which will expand to `delete from EntityName ...`
zh_cn: `from EntityName ...​` 语句会被扩展为： `delete from EntityName ...​`

source: `from EntityName ...` which will expand to `update from EntityName ...`
zh_cn: `from EntityName ...​` 语句会被扩展为： `update from EntityName ...​`

source: `getting-started-1.0.0-SNAPSHOT.jar` - containing just the classes and resources of the projects, it's the regular artifact produced by the Maven build - it is *not* the runnable jar;
zh_cn: `getting-started-1.0.0-SNAPSHOT.jar` - 它只包含项目的类和资源，是Maven构建时产生的常规组件——它是不可运行的jar。

source: `ignore` performs no commit. This strategy is the default strategy when the consumer is explicitly configured with `enable.auto.commit` to true. It delegates the offset commit to the underlying Kafka client. When `enable.auto.commit` is `true` this strategy **DOES NOT** guarantee at-least-once delivery. SmallRye Reactive Messaging processes records asynchronously, so offsets may be committed for records that have been polled but not yet processed. In case of a failure, only records that were not committed yet will be re-processed.
zh_cn: `ignore` 不执行任何提交。当消费者的 `enable.auto.commit` 属性被明确配置为true时，该策略将是默认策略。它将偏移量的提交委托给底层Kafka client负责。当 `enable.auto.commit` 为true的时候 ，该策略 *不* 保证至少会有一次提交。SmallRye Reactive Messaging是异步处理记录的，所以那些已经被轮询但尚未处理的record的偏移量有可能会被提交。如果提交失败，只有那些尚未被提交的record才会被重新处理。

source: `ignore`: the failure is logged, but the processing continue. The offset of the record that has not been processed correctly is committed.
zh_cn: `ignore` ：记录失败的日志，但消息处理将继续进行。没有被正确处理的记录的偏移量会被提交。

source: `int` and `java.lang.Integer`
zh_cn: `int` 和 `java.lang.Integer`

source: `io.quarkus.test.junit.callback.QuarkusTestAfterTestExecutionCallback`
zh_cn: `io.quarkus.test.junit.callback.QuarkusTestAfterEachCallback`

source: `io.quarkus.test.junit.callback.QuarkusTestBeforeTestExecutionCallback`
zh_cn: `io.quarkus.test.junit.callback.QuarkusTestBeforeEachCallback`

source: `io.quarkus.test.mongodb.MongoReplicaSetTestResource` will start a replicaset with two instances, one on port 27017 and the other on port 27018.
zh_cn: `io.quarkus.test.mongodb.MongoReplicaSetTestResource` 将启动一个有两个实例的复制集，一个在27017端口，另一个在27018端口。

source: `io.quarkus.test.mongodb.MongoTestResource` will start a single instance on port 27017.
zh_cn: `io.quarkus.test.mongodb.MongoTestResource` 将在27017端口启动一个单一的实例。

source: `io.quarkus:quarkus-mailer` (extension)
zh_cn: `io.quarkus:quarkus-mailer` (扩展)

source: `io.quarkus:quarkus-reactive-db2-client` (extension)
zh_cn: `io.quarkus:quarkus-reactive-db2-client` (扩展)

source: `io.quarkus:quarkus-reactive-mssql-client` (extension)
zh_cn: `io.quarkus:quarkus-reactive-mssql-client` (扩展)

source: `io.quarkus:quarkus-reactive-mysql-client` (extension)
zh_cn: `io.quarkus:quarkus-reactive-mysql-client` (扩展)

source: `io.quarkus:quarkus-reactive-oracle-client` (extension)
zh_cn: `io.quarkus:quarkus-reactive-oracle-client` (扩展)

source: `io.quarkus:quarkus-reactive-pg-client` (extension)
zh_cn: `io.quarkus:quarkus-reactive-pg-client` (扩展)

source: `io.quarkus:quarkus-redis-client` (extension)
zh_cn: `io.quarkus:quarkus-redis-client` (扩展)

source: `io.quarkus:quarkus-smallrye-reactive-messaging-amqp` (extension)
zh_cn: `io.quarkus:quarkus-smallrye-reactive-messaging-amqp` (扩展)

source: `io.quarkus:quarkus-smallrye-reactive-messaging-kafka` (extension)
zh_cn: `io.quarkus:quarkus-smallrye-reactive-messaging-kafka` (扩展)

source: `io.quarkus:quarkus-smallrye-reactive-messaging-mqtt` (extension)
zh_cn: `io.quarkus:quarkus-smallrye-reactive-messaging-mqtt` (扩展)

source: `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` is used by default to parse and verify JWT tokens and convert them to `JsonWebToken` principals. It uses `MP JWT` and `smallrye-jwt` properties listed in the `Configuration` section to verify and customize JWT tokens.
zh_cn: `io.smallrye.jwt.auth.principal.DefaultJWTCallerPrincipalFactory` 默认用于解析和验证JWT令牌，并将其转换为 `JsonWebToken`。它使用 `MP JWT` `smallrye-jwt` 这些在 `Configuration` 中列出的属性来验证和定制JWT令牌。

source: `io.smallrye.reactive:smallrye-mutiny-vertx-circuit-breaker` (external dependency)
zh_cn: `io.smallrye.reactive:smallrye-mutiny-vertx-circuit-breaker` (外部依赖性)

source: `io.smallrye.reactive:smallrye-mutiny-vertx-consul-client` (external dependency)
zh_cn: `io.smallrye.reactive:smallrye-mutiny-vertx-consul-client` (外部依赖性)

source: `io.smallrye.reactive:smallrye-mutiny-vertx-rabbitmq-client` (external dependency)
zh_cn: `io.smallrye.reactive:smallrye-mutiny-vertx-rabbitmq-client` (外部依赖性)

source: `io.smallrye.reactive:smallrye-mutiny-vertx-web-client` (external dependency)
zh_cn: `io.smallrye.reactive:smallrye-mutiny-vertx-web-client` (外部依赖性)

source: `io.vertx.core.Vertx` instance exposing the _bare_ Vert.x API
zh_cn: `io.vertx.core.Vertx` 暴露了 _bare_ Vert.x API的实例

source: `io.vertx.mutiny.core.Vertx` instance exposing the _Mutiny_ API
zh_cn: `io.vertx.mutiny.core.Vertx` 暴露 _Mutiny_ API的实例

source: `java.util.logging.manager` (see xref:logging.adoc[Logging Guide])
zh_cn: `java.util.logging.manager` (见 link:logging.html[日志指南] )

source: `lastname is not null` will be mapped to `{'lastname':{'$exists': true}}`
zh_cn: `lastname is not null` 将被映射到 `{'lastname':{'$exists': true}}`

source: `lastname like ?1` will be mapped to `{'lastname': {'$regex': ?1}}`. Be careful that this will be link:https://docs.mongodb.com/manual/reference/operator/query/regex/#op._S_regex[MongoDB regex] support and not SQL like pattern.
zh_cn: `lastname like ?1` 将被映射到 `{'lastname': {'$regex': ?1}}` 。注意 link:https://docs.mongodb.com/manual/reference/operator/query/regex/#op._S_regex[MongoDB的regex] 支持，而不是类似SQL模式。

source: `latest` commits the record offset received by the Kafka consumer as soon as the associated message is acknowledged (if the offset is higher than the previously committed offset). This strategy provides at-least-once delivery if the channel processes the message without performing any asynchronous processing. This strategy should not be used in high load environment, as offset commit is expensive. However, it reduces the risk of duplicates.
zh_cn: `latest` 一旦关联消息被确认，Kafka消费者就会提交所接收到的record偏移量(前提是当前偏移量高于之前提交的偏移量)。如果channel在不执行任何异步处理的情况下处理消息的话，这种策略能保证至少一次提交。这种策略不推荐在高负载环境中使用，因为偏移量的提交很昂贵。但是它减少了消息重复提交的风险。

source: `libsunec.so` must be added to `function.zip`
zh_cn: 必须将 `libsunec.so` 添加到 `function.zip` 中

source: `long` and `java.lang.Long`
zh_cn: `long` 和 `java.lang.Long`

source: `manage.sh` supports four operation: `create`, `delete`, `update`, and `invoke`.
zh_cn: `manage.sh` 支持四种操作： `create`， `delete`， `update` 和 `invoke` 。

source: `maven.home` (only if there are any custom settings in `${maven.home}/conf/settings.xml`, see xref:maven-tooling.adoc[Maven Guide])
zh_cn: `maven.home` (仅当 `${maven.home}/conf/settings.xml` 中有自定义设置时，见link:maven-tooling.html[Maven指南] )

source: `maven.settings` (in case a custom version of `settings.xml` file should be used for the tests)
zh_cn: `maven.settings` (以备在测试中使用自定义的 `settings.xml` 文件)

source: `modified-failed-undeliverable-here` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). It also indicates that the application cannot process the message, meaning that the broker will not attempt to redeliver the message to this node. The processing continues with the next message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
zh_cn: `modified-failed-undeliverable-here` - 这个策略将AMQP消息标记为 _modified_ ，并指出它失败了（使用 `delivery-failed` 属性）。它还表示应用程序不能处理该消息，这意味着代理不会试图将该消息重新交付给这个节点。继续处理下一条消息。请参考 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[修改后的交付状态的文档]

source: `modified-failed` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). The processing continues with the next message, but the broker may attempt to redeliver the message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
zh_cn: `modified-failed` - 这个策略将AMQP消息标记为 _modified_ ，并指出它失败了（使用 `delivery-failed` 属性）。继续处理下一条消息，但代理可能会尝试重新交付该消息。请参考 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[修改后的交付状态的文档]

source: `mongo+srv://` urls are supported out of the box in JVM mode. However, in native, the default DNS resolver, provided by the MongoDB client, uses JNDI and does not work in native mode.
zh_cn: `mongo+srv://` urls在JVM模式下支持开箱即用。然而，在本地模式下，MongoDB客户端提供的默认DNS解析器使用的是JNDI，在本地模式下无法工作。

source: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` is configured
zh_cn: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` 已配置

source: `mp.messaging.connector.smallrye-kafka.schema.registry.url` is configured
zh_cn: `mp.messaging.connector.smallrye-kafka.schema.registry.url` 已配置

source: `order by ...` which will expand to `from EntityName order by ...`
zh_cn: `order by ...` 语句会被扩展为： `from EntityName order by ...`

source: `publish` a message to a specific address - all consumers receive the messages.
zh_cn: `publish` 向一个特定的地址发送消息--所有的消费者都会收到这些消息。

source: `quarkus-elytron-security-oauth2` provides an alternative to the `quarkus-oidc` Bearer Token authentication mechanism. `quarkus-elytron-security-oauth2` is based on `Elytron` and is primarily intended for introspecting opaque tokens remotely. For more information, see xref:security-oauth2.adoc[Using OAuth2].
zh_cn: `quarkus-elytron-security-oauth2` 提供了一个替代 `quarkus-oidc` Bearer Token认证机制的方法。它基于 `Elytron` 并且主要是为了对不透明的token进行远程自我检查。更多信息请参见 link:security-oauth2.html[使用OAuth2] 指南。

source: `quarkus-junit5` is required for testing, as it provides the `@QuarkusTest` annotation that controls the testing framework. `rest-assured` is not required but is a convenient way to test HTTP endpoints, we also provide integration that automatically sets the correct URL so no configuration is required.
zh_cn: `quarkus-junit5` 是测试所必需的，因为它提供 `@QuarkusTest` 注解来控制测试框架。而 `rest-assured` 不是必需的，但它是测试HTTP节点的一种便捷方式，我们还集成对自动设置正确URL的支持，因此不需要配置。

source: `quarkus-oidc` and `quarkus-smallrye-jwt` support the injecting of JWT and opaque tokens into the endpoint code. Injected JWT tokens provide more information about the user. All extensions can have the tokens injected as `Principal`.
zh_cn: `quarkus-oidc` 和 `quarkus-smallrye-jwt` 支持将JWT和不透明的token都注入到节点代码中。注入的JWT token可以提供更丰富的用户信息。所有的扩展都可以将 token 以 `Principal` 的形式注入。

source: `quarkus-oidc` provides `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces which can be used to implement `@ApplicationScoped` cache implementation which can be used to store and retrieve `quarkus.oidc.TokenIntrospection` and/or `quarkus.oidc.UserInfo` objects, for example:
zh_cn: `quarkus-oidc` 提供 `quarkus.oidc.TokenIntrospectionCache` 和 `quarkus.oidc.UserInfoCache` 接口，可用于实现 `@ApplicationScoped` 缓存实现，可用于存储和检索 `quarkus.oidc.TokenIntrospection` 和/或 `quarkus.oidc.UserInfo` 对象，例如：

source: `quarkus-oidc` requires an OpenID Connect provider such as Keycloak, which can be used to verify the Bearer tokens or authenticate the end users with the Authorization Code flow. In both cases, `quarkus-oidc` requires a connection to the specified OpenID Connect provider.
zh_cn: `quarkus-oidc` 扩展需要一个OpenID Connect提供者，如Keycloak，用以验证Bearer tokens或用Authorization Code flow验证终端用户。在这两种情况下 `quarkus-oidc` 需要连接到这个OpenID Connect提供者。

source: `quarkus-release` used for Quarkus release blogs
zh_cn: `quarkus-release` 用于Quarkus发布博客

source: `quarkus-smallrye-jwt` handles locally signed, inner-signed-and-encrypted, and encrypted tokens. While `quarkus-oidc` and `quarkus-elytron-security-oauth2` can also verify such tokens but treats them as opaque tokens and verifies them through remote introspection.
zh_cn: `quarkus-smallrye-jwt` 不仅可以在本地处理有签名的 token ，而且还可以处理内部签名并加密(inner-signed-and-encrypted)和单纯加密的 token 。事实上， `quarkus-oidc` 和 `quarkus-elytron-security-oauth2` 也可以验证这样的 token ，但只能把它们当作不透明的 token ，并通过远程自查来验证。

source: `quarkus-smallrye-jwt` is an alternative to the `quarkus-oidc` Bearer Token authentication mechanism, and verifies only `JWT` tokens by using either PEM keys or the refreshable `JWK` key set. `quarkus-smallrye-jwt` also provides the JWT generation API, which you can use to easily create `signed`, `inner-signed`, and `encrypted` `JWT` tokens.
zh_cn: `quarkus-smallrye-jwt` 提供了一个替代 `quarkus-oidc` Bearer Token认证机制的方法，并且目前只能验证使用PEM密钥或可刷新的 `JWK` 密钥集的 `JWT` token。此外，`quarkus-smallrye-jwt` 还提供了 JWT generation API`，以便轻松创建 `signed` 、 `inner-signed` 和 `encrypted` `JWT` token。

source: `quarkus-smallrye-jwt` supports more key formats than `quarkus-oidc`. `quarkus-oidc` uses only the JWK-formatted keys that are part of a JWK set, whereas `quarkus-smallrye-jwt` supports PEM keys.
zh_cn: `quarkus-smallrye-jwt` 比 `quarkus-oidc` 支持更多的密钥格式。后者只使用属于JWK集的JWK格式的密钥，反之前者还支持PEM密钥。

source: `quarkus.amqp.devservices.enabled` is set to `false`
zh_cn: `quarkus.amqp.devservices.enabled` 被设置为 `false`

source: `quarkus.apicurio-registry.devservices.enabled` is set to `false`
zh_cn: `quarkus.apicurio-registry.devservices.enabled` 设为 `false`

source: `quarkus.container-image.build=true` instructs Quarkus to create a container-image using the final application artifact (which is the native executable in this case)
zh_cn: `quarkus.container-image.build=true` 指示Quarkus使用最终的应用程序工件（在本例中是原生可执行文件）创建一个容器镜像

source: `quarkus.kafka.devservices.enabled` is set to `false`
zh_cn: `quarkus.kafka.devservices.enabled` 被设置为 `false`

source: `quarkus.native.container-build=true` allows for creating a Linux executable without GraalVM being installed (and is only necessary if you don't have GraalVM installed locally or your local operating system is not Linux)
zh_cn: `quarkus.native.container-build=true` 允许在不安装GralVM的情况下创建一个Linux可执行文件（只有在你没有安装GralVM或者你的本地操作系统不是Linux的情况下才需要）

source: `quarkus.oidc.client-id` property identifies an OpenID Connect Client which requested the current bearer token. It can be an SPA application running in a browser or a Quarkus `web-app` confidential client application propagating the access token to the Quarkus `service` application.
zh_cn: `quarkus.oidc.client-id` 属性标识请求当前持有者令牌的 OpenID Connect Client。它可以是在浏览器中运行的SPA应用程序，也可以是Quarkus `web-app` 机密客户端应用程序，将访问令牌传播到Quarkus `service` 的应用程序。
